import { BotMessageSquare } from "lucide-react";
import { BatteryCharging } from "lucide-react";
import { Fingerprint } from "lucide-react";
import { ShieldHalf } from "lucide-react";
import { PlugZap } from "lucide-react";
import { GlobeLock } from "lucide-react";

import user1 from "../assets/profile-pictures/user1.jpeg";
import user2 from "../assets/profile-pictures/user2.jpeg";
import user3 from "../assets/profile-pictures/user3.jpeg";
import user4 from "../assets/profile-pictures/user4.jpeg";

export const navItems = [
  { label: "முகப்பு", href: "/" },
  { label: "திறன் மேம்பாடு", href: "/features" },
  { label: "ஆரோக்கியம்|பாதுகாப்பு", href: "/safe" },
  { label: "சமூகம்", href: "/social" },
  { label: "வணிக பார்வை", href: "/new" },]

export const features = [
  {
    icon: <BotMessageSquare />,
    text: "திறன் மேம்பாட்டு பயிற்சிகள்",
    description:
      "மேம்பட்ட நெசவு தொழில்நுட்பங்கள்,கருவிகளை கையாளுதல்,பாரம்பரிய கலைப் பாதுகாப்பு.",
  },
  {
    icon: <Fingerprint />,
    text: "பாரம்பரிய கலைப் பாதுகாப்பு",
    description:
      "டிஜிட்டல் வடிவமைப்பு கருவிகள்,தானியங்கி மின்னணு கருவிகள்,மின்னணு வணிக தளங்கள்.",  },
  {
    icon: <ShieldHalf />,
    text: "வணிக மற்றும் சந்தைப்படுத்தல் திறன்கள்",
    description:
      "தனிப்பட்ட பிராண்டை உருவாக்குதல்,விலை நிர்ணய முறைகள்,சமூக ஊடக விளம்பரம்.",
  },
  {
    icon: <BatteryCharging />,
    text: "நெசவாளர்கள் சமுதாயத்துடன் இணைப்பு",
    description:
      "நெசவாளர் கூட்டுறவு அமைப்புகள்,கண்காட்சிகள் மற்றும் விற்பனை விழாக்கள்,மார்க்கமேட் போன்ற திட்டங்கள்.",
  },
  {
    icon: <PlugZap />,
    text: "நிலைத்தன்மை மற்றும் புதுமை",
    description:
      "பசுமை விருப்பங்களை அமல்படுத்துதல்,மீள்பயன்பாடு மற்றும் மறுசுழற்சி,புதுமையான நெசவு தொழில்நுட்பம்.",
  },
  {
    icon: <GlobeLock />,
    text: "நிதி மற்றும் கல்வி திறன் மேம்பாடு",
    description:
      "நிதி மேலாண்மை,அடிப்படை கல்வி,அரசு திட்டங்கள் அறிவுரை.",
  },
];

export const checklistItems = [
  {
    title: "உடல் நலம் பாதுகாப்பு (Ergonomic Workspace)",
    description:
      "உடல் சோர்வை குறைக்க சரியான நிலைமை கொண்ட வேலை இடங்களை உருவாக்குதல்.",
  },
  {
    title: "சுவாசத்திற்கான பாதுகாப்பு (Proper Ventilation)",
    description:
      "துகள்மாசு மற்றும் நச்சு வாயுக்களை தடுக்கும் விதமாக காற்றோட்டம் ஏற்படுத்துதல்.",
  },
  {
    title: "மன நல பாதுகாப்பு (Mental Well-being)",
    description:
      "மன அழுத்தத்தை குறைக்க ஆலோசனை மற்றும் மனநலம் பாதுகாப்பு பயிற்சிகள் வழங்குதல்.வேலை நேரத்தில் அமைதியான இடங்களில் ஓய்வு எடுக்க அனுமதி வழங்குதல்.",
  },
  {
    title: "சரியான தகவல் மற்றும் பயிற்சி (Awareness and Training)",
    description:
      "புனைவுத் தொழிலின் ஆபத்துகளை பற்றி விழிப்புணர்வு நிகழ்ச்சிகள் நடத்துதல்.ஆபத்து நேரத்திற்கான முதலுதவி பயிற்சி அளித்தல்.",
  },
];

export const checklistItems1 = [
  {
    title: "நவீன தொழில்நுட்பங்கள்",
    description:
      "படிமமான மற்றும் திறன் கூடிய பவர்லூம் இயந்திரங்கள், பாரம்பரிய தொழில்நுட்பங்களுடன் ஒப்பிடும்போது, எவ்வாறு உற்பத்தி வேகத்தை அதிகரிக்கின்றன மற்றும் மூலதன செலவினை குறைக்கின்றன.",
  },
  {
    title: "ஆட்டோமேஷன் மற்றும் ரோபோட்டிக்ஸ் பயன்பாடு",
    description:
      "தொழில்நுட்பத்தில் ஆட்டோமேஷன் மற்றும் ரோபோட்டிக்ஸ் அடிப்படையில், உற்பத்தி செயல்திறன் மற்றும் தரத்தின் மேம்பாடு.",
  },
  {
    title: "திரிகோண மற்றும் பில்ட்-இன் சிஸ்டம்",
    description:
      " பவர்லூம் இயந்திரங்களில் எளிதான பராமரிப்பு மற்றும் இயந்திர மாற்றங்கள் மூலம், வேலைநிறுத்தத்தை குறைப்பதற்கான புதிய தீர்வுகள்.",
  },
  {
    title: "மின்சார நெட்வொர்க் மற்றும் IoT இணைப்பு",
    description:"பவர்லூம் இயந்திரங்களை இணையதள நெட்வொர்க்குடன் இணைத்து, திறமையான கண்காணிப்பு மற்றும் பராமரிப்பை எளிதாக்குவது."
  }
];

export const pricingOptions = [
  {
    title: "அனுபவங்களை பகிர்வது",
    price: user1,
    features: [
      "நெசவாளர்கள் தங்கள் கதைகளைப் பகிரவும், ஆலோசனை பெறவும், தொழில் மற்றும் வாழ்க்கையில் புதிய வாய்ப்புகளை ஆராயவும் முடிகிறது.சமூகத்தில் உறவுகளை வலுப்படுத்தவும் உதவுகிறது."],
  },
  {
    title: "சிறந்த ஒன்றிணைந்த கற்றல்",
    price: user2,
    features: [
      "நவீன தொழில்நுட்பம் மூலம் திறன் மேம்பாட்டு பாடங்கள், நேரடி பட்டறைகள், மற்றும் தொழில்முறை கற்றல் போன்றவை பாரம்பரிய திறன்கள் வளர்ச்சி பெறும்."
    ],
  },
  {
    title: "சந்தை இணைப்புகள்",
    price: user3,
    features: [
      "மொபைல் மூலம், நெசவாளர்கள் உலகளவில் நேரடியாக வாங்கியவர்களுடன் தொடர்பு கொள்ள முடியும். இதனால் இடைத்தரகரின் செயல்பாடு குறைந்து, நியாயமான விலையைப் பெற உதவுகிறது",
    ],
  },
  {
    title: "ஆதரவும் ஒத்துழைப்பும்",
    price: user4,
    features: [
      "ஒரு இணையதள சமூகத்தின் மூலம், நெசவாளர்கள் சிரமமான நேரங்களில் உதவி பெறலாம், மற்றும் பொருட்களின் பற்றாக்குறை போன்ற பிரச்சினைகளைத் தீர்க்க முடியும்.",
],
  },]